#include <stdio.h>
 int main(){
    int a = 5, b =17 ;                                                // ประกาศตัวแปร int
    float c= 8.5 , d = 4.0 ;                                         // ประกาศตัวแปร float

    printf("ตัวแปรทั้งหมด a=%d b=%d c=%.1f d=%.1f\n",a,b,c,d) ;     // แสดงค่าตัวแปรทั้งหมด
    printf("ผลการคำนวณของ d + a = %.1f\n",d + a);                // แสดงผลการคำนวณของ d + a ค่า 4.0 + 5
    printf("ผลการคำนวณของ a - b = %d\n",a - b);                  // แสดงผลการคำนวณของ a - b ค่า 5 - 17
    printf("ผลการคำนวณของ c * d = %.1f\n",c * d);            // แสดงผลการคำนวณของ c * d   ค่า 8.5 * 4.0
    printf("ผลการคำนวณของ a * c = %.1f\n",a * c);            // แสดงผลการคำนวณของ a * c ค่า 5 * 8.5
    printf("ผลการคำนวณของ c / d = %.1f\n",c / d);            // แสดงผลการคำนวณของ c / d ค่า 8.5 / 4.0
    printf("ผลการคำนวณของ b / c = %.1f\n",b / c);            // แสดงผลการคำนวณของ b / c ค่า 17 / 8.5
    printf("ผลการคำนวณของ a %% b = %d\n", a % b);            // แสดงผลการคำนวณของ a % b ค่า 5 % 17
    printf("ผลการคำนวณของ c %% a = %.1f\n",c % a);           // ผลการคำนวณของ c % a   (Error เพราะ c เป็น float )
    printf("ผลการคำนวณของ c %% d = %.1f\n",c % d);           // ผลการคำนวณของ c % d (Error เพราะ d เป็น float)

    return 0 ;                                                // ส่งค่ากลับ 0 เพื่อบอกว่าโปรแกรมทำงานสำเร็จ

 }